/*
如你所见的笔记环节

需要的系统
momotalk：桃信是看scenes用的
角色：废话，拉人练级升好感是玩家提升实力的主要手段
学院：kivotos是由各个学院组成的，一个slg也得有个招募杂鱼酱的系统，风味化的设计也得依靠学院进行
危机：矛盾提供者，也是填色动力

momotalk：
    先跳过

角色：
    ID：方便检索用
    name
    物品：
        武器：喂素材，也就是升级的地方，就不要给角色绑等级了
        配件：服装、礼物什么的，用来做攻击/防御属性的转换、加能力、对应BA里同名角色的不同卡
    属性：
        能力，姑且要分以下运营能力和战斗能力，之后再说
        好感度，考虑到不太想用sense做主控也许应该换成忠诚度
    所属学院和社团：
        角色收集需要有转学机制，好在BA里确实有先例

学院：
    学制：类似整体的东西，用来绑定学院任务，提供各种风味事件和全局buff
    规模：决定资金获取能力和人力（杂鱼酱）的规模
    社团：总所周知BA里有各种各样的社团，用来提供角色的风味事件和buff，把buff拆这么开真的好吗？不提供buff比较好，而且也没有换社团的必要，大多数社团也不会和学院绑定

危机：
    总力战和主线BOSS上班的地方，也是游戏的主线环节。
    危机由以下循环构成：
        萌芽：通常有一个学院或者个人事件触发暗示可能的危机
        触发：一个对不同学院来说稍有区别的全局事件，这将使危机出现在UI界面并改变一些角色/势力的状态，对于直接相关的势力来说这意味着一个导向阶段性胜利或者BE的任务，对于遥远的势力则无关紧要（当然消极介入会导致某些未来想要收集的角色/组织变为不可用）
        发展：周边势力被强制介入危机之中，这个阶段作为玩家扮演周边势力时吞并/拉人的机会，如果玩家可以介入解决危机的话
        高潮：该打BOSS了，在此结算之前的各个变量决定结局
        结局：发糖时间
*/